docs/design/hub-and-spoke/crud/update/flow-update-fsm.dot
digraph {
compound=true;
subgraph cluster_StateMachine {
label="org.openkilda.wfm.topology.flowhs.fsm.update.FlowUpdateFsm";
PATHS_SWAP_REVERTED [label="PATHS_SWAP_REVERTED"];
FINISHED [label="FINISHED"];
REVERTING_FLOW [label="REVERTING_FLOW"];
FLOW_VALIDATED [label="FLOW_VALIDATED"];
OLD_PATHS_REMOVAL_COMPLETED [label="OLD_PATHS_REMOVAL_COMPLETED"];
PROTECTED_RESOURCES_ALLOCATED [label="PROTECTED_RESOURCES_ALLOCATED"];
RESOURCES_ALLOCATION_REVERTED [label="RESOURCES_ALLOCATION_REVERTED"];
OLD_RULES_REMOVED [label="OLD_RULES_REMOVED"];
UPDATING_FLOW_STATUS [label="UPDATING_FLOW_STATUS"];
REMOVING_OLD_RULES [label="REMOVING_OLD_RULES"];
RESOURCE_ALLOCATION_COMPLETED [label="RESOURCE_ALLOCATION_COMPLETED"];
FLOW_UPDATED [label="FLOW_UPDATED"];
INITIALIZED [label="INITIALIZED"];
FLOW_STATUS_UPDATED [label="FLOW_STATUS_UPDATED"];
NON_INGRESS_RULES_VALIDATED [label="NON_INGRESS_RULES_VALIDATED"];
INGRESS_RULES_INSTALLED [label="INGRESS_RULES_INSTALLED"];
PRIMARY_RESOURCES_ALLOCATED [label="PRIMARY_RESOURCES_ALLOCATED"];
REVERTING_FLOW_STATUS [label="REVERTING_FLOW_STATUS"];
VALIDATING_NON_INGRESS_RULES [label="VALIDATING_NON_INGRESS_RULES"];
REVERTING_NEW_RULES [label="REVERTING_NEW_RULES"];
FINISHED_WITH_ERROR [label="FINISHED_WITH_ERROR"];
VALIDATING_INGRESS_RULES [label="VALIDATING_INGRESS_RULES"];
REVERTING_ALLOCATED_RESOURCES [label="REVERTING_ALLOCATED_RESOURCES"];
NEW_PATHS_INSTALLATION_COMPLETED [label="NEW_PATHS_INSTALLATION_COMPLETED"];
REVERTING_PATHS_SWAP [label="REVERTING_PATHS_SWAP"];
PATHS_SWAPPED [label="PATHS_SWAPPED"];
INSTALLING_INGRESS_RULES [label="INSTALLING_INGRESS_RULES"];
INGRESS_RULES_VALIDATED [label="INGRESS_RULES_VALIDATED"];
OLD_RESOURCES_DEALLOCATED [label="OLD_RESOURCES_DEALLOCATED"];
NEW_RULES_REVERTED [label="NEW_RULES_REVERTED"];
DEALLOCATING_OLD_RESOURCES [label="DEALLOCATING_OLD_RESOURCES"];
NON_INGRESS_RULES_INSTALLED [label="NON_INGRESS_RULES_INSTALLED"];
INSTALLING_NON_INGRESS_RULES [label="INSTALLING_NON_INGRESS_RULES"];

PATHS_SWAP_REVERTED -> REVERTING_NEW_RULES [ label="NEXT"];
PATHS_SWAP_REVERTED -> REVERTING_NEW_RULES [ label="ERROR"];
REVERTING_FLOW -> REVERTING_FLOW_STATUS [ label="NEXT"];
REVERTING_FLOW -> REVERTING_FLOW_STATUS [ label="ERROR"];
FLOW_VALIDATED -> FLOW_UPDATED [ label="NEXT"];
FLOW_VALIDATED -> REVERTING_FLOW_STATUS [ label="TIMEOUT"];
FLOW_VALIDATED -> REVERTING_FLOW_STATUS [ label="ERROR"];
OLD_PATHS_REMOVAL_COMPLETED -> DEALLOCATING_OLD_RESOURCES [ label="NEXT"];
OLD_PATHS_REMOVAL_COMPLETED -> DEALLOCATING_OLD_RESOURCES [ label="ERROR"];
PROTECTED_RESOURCES_ALLOCATED -> RESOURCE_ALLOCATION_COMPLETED [ label="NEXT"];
PROTECTED_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="TIMEOUT"];
PROTECTED_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="ERROR"];
PROTECTED_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="NO_PATH_FOUND"];
RESOURCES_ALLOCATION_REVERTED -> REVERTING_FLOW [ label="NEXT"];
RESOURCES_ALLOCATION_REVERTED -> REVERTING_FLOW [ label="ERROR"];
OLD_RULES_REMOVED -> OLD_PATHS_REMOVAL_COMPLETED [ label="NEXT"];
UPDATING_FLOW_STATUS -> FLOW_STATUS_UPDATED [ label="NEXT"];
REMOVING_OLD_RULES -> REMOVING_OLD_RULES [ label="RESPONSE_RECEIVED"];
REMOVING_OLD_RULES -> REMOVING_OLD_RULES [ label="ERROR_RECEIVED"];
REMOVING_OLD_RULES -> OLD_RULES_REMOVED [ label="RULES_REMOVED"];
REMOVING_OLD_RULES -> OLD_RULES_REMOVED [ label="ERROR"];
RESOURCE_ALLOCATION_COMPLETED -> INSTALLING_NON_INGRESS_RULES [ label="NEXT"];
RESOURCE_ALLOCATION_COMPLETED -> REVERTING_ALLOCATED_RESOURCES [ label="TIMEOUT"];
RESOURCE_ALLOCATION_COMPLETED -> REVERTING_ALLOCATED_RESOURCES [ label="ERROR"];
FLOW_UPDATED -> PRIMARY_RESOURCES_ALLOCATED [ label="NEXT"];
FLOW_UPDATED -> REVERTING_FLOW [ label="TIMEOUT"];
FLOW_UPDATED -> REVERTING_FLOW [ label="ERROR"];
INITIALIZED -> FLOW_VALIDATED [ label="NEXT"];
INITIALIZED -> FINISHED_WITH_ERROR [ label="TIMEOUT"];
FLOW_STATUS_UPDATED -> FINISHED [ label="NEXT"];
FLOW_STATUS_UPDATED -> FINISHED_WITH_ERROR [ label="ERROR"];
NON_INGRESS_RULES_VALIDATED -> PATHS_SWAPPED [ label="NEXT"];
NON_INGRESS_RULES_VALIDATED -> PATHS_SWAP_REVERTED [ label="TIMEOUT"];
NON_INGRESS_RULES_VALIDATED -> PATHS_SWAP_REVERTED [ label="ERROR"];
INGRESS_RULES_INSTALLED -> VALIDATING_INGRESS_RULES [ label="NEXT"];
INGRESS_RULES_INSTALLED -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
INGRESS_RULES_INSTALLED -> REVERTING_PATHS_SWAP [ label="ERROR"];
PRIMARY_RESOURCES_ALLOCATED -> PROTECTED_RESOURCES_ALLOCATED [ label="NEXT"];
PRIMARY_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="TIMEOUT"];
PRIMARY_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="ERROR"];
PRIMARY_RESOURCES_ALLOCATED -> REVERTING_ALLOCATED_RESOURCES [ label="NO_PATH_FOUND"];
REVERTING_FLOW_STATUS -> FINISHED_WITH_ERROR [ label="NEXT"];
REVERTING_FLOW_STATUS -> FINISHED_WITH_ERROR [ label="ERROR"];
VALIDATING_NON_INGRESS_RULES -> VALIDATING_NON_INGRESS_RULES [ label="RESPONSE_RECEIVED"];
VALIDATING_NON_INGRESS_RULES -> VALIDATING_NON_INGRESS_RULES [ label="ERROR_RECEIVED"];
VALIDATING_NON_INGRESS_RULES -> NON_INGRESS_RULES_VALIDATED [ label="RULES_VALIDATED"];
VALIDATING_NON_INGRESS_RULES -> PATHS_SWAP_REVERTED [ label="TIMEOUT"];
VALIDATING_NON_INGRESS_RULES -> PATHS_SWAP_REVERTED [ label="MISSING_RULE_FOUND"];
VALIDATING_NON_INGRESS_RULES -> PATHS_SWAP_REVERTED [ label="ERROR"];
REVERTING_NEW_RULES -> REVERTING_NEW_RULES [ label="RESPONSE_RECEIVED"];
REVERTING_NEW_RULES -> REVERTING_NEW_RULES [ label="ERROR_RECEIVED"];
REVERTING_NEW_RULES -> NEW_RULES_REVERTED [ label="RULES_REMOVED"];
REVERTING_NEW_RULES -> NEW_RULES_REVERTED [ label="ERROR"];
VALIDATING_INGRESS_RULES -> VALIDATING_INGRESS_RULES [ label="RESPONSE_RECEIVED"];
VALIDATING_INGRESS_RULES -> VALIDATING_INGRESS_RULES [ label="ERROR_RECEIVED"];
VALIDATING_INGRESS_RULES -> INGRESS_RULES_VALIDATED [ label="RULES_VALIDATED"];
VALIDATING_INGRESS_RULES -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
VALIDATING_INGRESS_RULES -> REVERTING_PATHS_SWAP [ label="MISSING_RULE_FOUND"];
VALIDATING_INGRESS_RULES -> REVERTING_PATHS_SWAP [ label="ERROR"];
REVERTING_ALLOCATED_RESOURCES -> RESOURCES_ALLOCATION_REVERTED [ label="NEXT"];
REVERTING_ALLOCATED_RESOURCES -> RESOURCES_ALLOCATION_REVERTED [ label="ERROR"];
NEW_PATHS_INSTALLATION_COMPLETED -> REMOVING_OLD_RULES [ label="NEXT"];
NEW_PATHS_INSTALLATION_COMPLETED -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
NEW_PATHS_INSTALLATION_COMPLETED -> REVERTING_PATHS_SWAP [ label="ERROR"];
REVERTING_PATHS_SWAP -> PATHS_SWAP_REVERTED [ label="NEXT"];
PATHS_SWAPPED -> INSTALLING_INGRESS_RULES [ label="NEXT"];
PATHS_SWAPPED -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
PATHS_SWAPPED -> REVERTING_PATHS_SWAP [ label="ERROR"];
INSTALLING_INGRESS_RULES -> INSTALLING_INGRESS_RULES [ label="RESPONSE_RECEIVED"];
INSTALLING_INGRESS_RULES -> INSTALLING_INGRESS_RULES [ label="ERROR_RECEIVED"];
INSTALLING_INGRESS_RULES -> INGRESS_RULES_INSTALLED [ label="RULES_INSTALLED"];
INSTALLING_INGRESS_RULES -> INGRESS_RULES_VALIDATED [ label="INGRESS_IS_SKIPPED"];
INSTALLING_INGRESS_RULES -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
INSTALLING_INGRESS_RULES -> REVERTING_PATHS_SWAP [ label="ERROR"];
INGRESS_RULES_VALIDATED -> NEW_PATHS_INSTALLATION_COMPLETED [ label="NEXT"];
INGRESS_RULES_VALIDATED -> REVERTING_PATHS_SWAP [ label="TIMEOUT"];
INGRESS_RULES_VALIDATED -> REVERTING_PATHS_SWAP [ label="ERROR"];
OLD_RESOURCES_DEALLOCATED -> UPDATING_FLOW_STATUS [ label="NEXT"];
OLD_RESOURCES_DEALLOCATED -> UPDATING_FLOW_STATUS [ label="ERROR"];
NEW_RULES_REVERTED -> REVERTING_ALLOCATED_RESOURCES [ label="NEXT"];
NEW_RULES_REVERTED -> REVERTING_ALLOCATED_RESOURCES [ label="ERROR"];
DEALLOCATING_OLD_RESOURCES -> OLD_RESOURCES_DEALLOCATED [ label="NEXT"];
NON_INGRESS_RULES_INSTALLED -> VALIDATING_NON_INGRESS_RULES [ label="NEXT"];
NON_INGRESS_RULES_INSTALLED -> PATHS_SWAP_REVERTED [ label="TIMEOUT"];
NON_INGRESS_RULES_INSTALLED -> PATHS_SWAP_REVERTED [ label="ERROR"];
INSTALLING_NON_INGRESS_RULES -> INSTALLING_NON_INGRESS_RULES [ label="RESPONSE_RECEIVED"];
INSTALLING_NON_INGRESS_RULES -> INSTALLING_NON_INGRESS_RULES [ label="ERROR_RECEIVED"];
INSTALLING_NON_INGRESS_RULES -> NON_INGRESS_RULES_INSTALLED [ label="RULES_INSTALLED"];
INSTALLING_NON_INGRESS_RULES -> PATHS_SWAP_REVERTED [ label="TIMEOUT"];
INSTALLING_NON_INGRESS_RULES -> PATHS_SWAP_REVERTED [ label="ERROR"];}}
